# GetTextEditorOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextEditorOptions..::..GetTextEditorOptions Method
TextEditorOptions Class See Also
---
Returns the current Revit instance's TextEditorOptions.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static TextEditorOptions GetTextEditorOptions()
```

Visual Basic
---
```text
Public Shared Function GetTextEditorOptions As TextEditorOptions
```

Visual C++
---
```text
public:
static TextEditorOptions^ GetTextEditorOptions()
```

# ### Return Value
The TextEditorOptions for the current Revit instance.
# See Also
TextEditorOptions Class
Autodesk.Revit.UI Namespace